const Terms = () => {
  return (
    <>
      <div className="container mx-auto px-4 py-8">
        <h1 className="text-3xl font-bold text-gray-800 mb-8">
          차덕 서비스 이용 약관
        </h1>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제1조 (목적)
        </h2>
        <p className="mb-6 text-gray-600">
          본 서비스 약관은 회원이 요즘피플(이하 "회사"라 함)에서 제공하는 차덕
          및 차덕 제반 서비스(이하 "서비스"라 함)를 이용함에 있어 회원과
          회사간의 권리, 의무 및 책임사항을 규정함 을 목적으로 합니다.
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제2조 (약관의 효력 및 변경)
        </h2>
        <ol className="list-decimal pl-6 mb-6 text-gray-600">
          <li>
            ⓵ 본 약관은 서비스를 이용하고자 하는 모든 회원에 대하여 그 효력을
            발생합니다.
          </li>
          <li>
            ⓶ 본 약관의 내용은 서비스 화면에 게시하거나 기타의 방법으로 회원에게
            공시하고, 이에 동의한 회원이 서비스에 가입함으로써 효력이
            발생합니다.
          </li>
          <li>
            ⓷ 회사는 필요하다고 인정되는 경우 본 약관을 변경할 수 있으며, 회사가
            약관을 변경할 경우에는 적용일자 및 변경사유를 명시하여 제 2항과 같은
            방법으로 그 적용일자 15일 전 부터 공지하며, 회원에게 불리하거나
            중대한 약관의 변경인경우에는 그 적용일자 30일 전부 터 공지하며,
            E-mail, SMS, App Push 등으로 회원에게 개별 통지합니다. 단, 회원의
            연락처 미기재, 변경 후 미수정 등으로 인하여 개별 통지가 어려운
            경우에 한하여 본 항의 공지를 함으로써 개별 통지한 것으로 간주합니다.
          </li>
          <li>
            ⓸ 회사가 제 3항에 따라 변경 약관을 공지 또는 통지하면서, 회원에게
            약관 변경 적용일까 지 거부의사를 표시하지 아니할 경우, 약관의 변경에
            동의한 것으로 간주한다는 내용을 공지 또는 통지하였음에도 회원이
            명시적으로 약관 변경에 대한 거부의사를 표시하지 아니하면, 회원이
            변경 약관에 동의한 것으로 간주합니다. 회원은 변경된 약관 사항에
            동의하지 않으면 서비스 이용을 중단하고 이용 계약을 해지할 권리가
            있습니다.
          </li>
        </ol>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제3조 (약관 외 준칙)
        </h2>
        <p className="mb-6 text-gray-600">
          본 약관에 명시되지 않은 사항에 대해서는 정보통신망 이용촉진 및
          정보보호에 관한 법률 (이하 "정보통신망법"이라 함), 위치정보의 보호 및
          이용 등에 관한 법률(이하 "위치정보법" 이라 함), 개인정보 보호법,
          전기통신기본법, 전기통신사업법 등 관계 법령 및 회사가 정한 서비스의
          세부이용지침 등의 규정에 의합니다.
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제4조 (용어의 정의)
        </h2>
        <ol className="list-decimal pl-6 mb-6 text-gray-600">
          <li>
            “서비스”란 이용 고객 또는 회원이 PC, 이동전화, 휴대용 단말기 등 각종
            유무선 기기 또는 프로그램을 통하여 이용할 수 있도록 회사가
            차덕이라는 브랜드로 제공하는 서비스 및 위치기반 정보 제공/추천
            서비스, 및 관련 제반 서비스를 말합니다.
          </li>
          <li>
            “비회원”이란 회원가입 없이 "회사"가 제공하는 "서비스"를 이용하는
            자를 말합니다.
          </li>
          <li>
            “회원”이란 서비스 웹사이트 또는 서비스 전용 어플리케이션을 통하여 본
            약관에 동의하고, 서비스 이용을 신청하여, 회사로부터 서비스 이용에
            대한 자격을 부여 받은 고객을 말합니다.
          </li>
          <li>
            “사이트”란 서비스를 제공하는 유무선 홈페이지
            (http://www.chaduck.kr)를 말합니다.
          </li>
          <li>
            “ID”란 회원 식별과 회원의 서비스 이용을 위하여 회원이 선정하고
            회사가 승인하는 이동전화 번호 혹은 이메일 주소 혹은 영문자와 숫자의
            조합을 말합니다.
          </li>
          <li>
            “PASSWORD”란 회원의 정보 보호를 위해 회원 자신이 설정한 문자와
            숫자의 조합을 말합니다.
          </li>
          <li>
            “운영자”란 서비스의 전반적인 관리와 원활한 운영을 위하여 회사가
            선정한 자를 말합니다.
          </li>
          <li>
            “SMS인증”이란 이동전화로 SMS 난수를 발송하고, 고객이 해당 번호를
            사이트에 등록함으로써 이용 신청자와 이동전화 소지자가 동일인인 사실
            및 인증을 시도하는 자가 이용하는 이동통신사를 확인하는 절차를
            말합니다.
          </li>
          <li>
            “플레이스”란 서비스에 등록되어 있는 관광지, 카페, 음식점 등을
            말합니다.
          </li>
          <li>
            “오리알”이란 회원이 서비스 내에서 활동을 하면서 얻을 수 있는
            아이템으로 내용은 제 15조와 같습니다.
          </li>
          <li>
            “포인트”란 회원이 서비스 내에서 사용할 수 있는 재화로 내용은 제
            15조와 같습니다.
          </li>
          <li>
            “소셜”이란 회원이 게시물 및 후기글을 작성하거나 댓글을 작성할 수
            있는 커뮤니티(게시판)입니다.
          </li>
        </ol>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제5조 (이용 신청)
        </h2>
        <ol className="list-decimal pl-6 mb-6 text-gray-600">
          <li>
            ⓵ 서비스에 가입을 하여 이용하고자 하는 자는 본 약관에 동의하여
            가입절차를 진행합니다.
          </li>
          <li>
            ⓶ 서비스에 가입을 하여 이용하고자 하는 자는 회사에서 제공된 회원가입
            신청 양식에 따라 필요사항을 기재하여야 합니다. 회원가입 시
            기재항목은 필수 기재 항목과 선택 기재 항목으로 구분되어 있으며 필수
            기재 항목의 경우 반드시 입력을 해야 합니다.
          </li>
          <li>
            ⓷ 회사는 서비스에 가입을 하여 이용하고자 하는 자에게 "SMS 인증" 기타
            본인을 확인할 수 있는 인증절차를 요구할 수 있습니다.
          </li>
          <li>
            ⓸ 제 3항에 따른 인증의 정확성을 위하여 서비스에 가입을 하여
            이용하고자 하는 자는 본인 명의의 이동전화를 이용하여 인증절차를
            수행하여야 합니다.
          </li>
        </ol>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제6조 (이용 계약의 성립)
        </h2>
        <ol className="list-decimal pl-6 mb-6 text-gray-600">
          <li>
            ⓵ 이용계약은 회원이 되고자 하는 자가 본 약관의 내용에 동의를 한 후
            회원가입 신청 양식에 따라 필요한 항목을 기입•제출하는 방법으로
            회원가입 신청을 하고, 회사가 위 신청에 승낙함으로써 체결됩니다.
          </li>
          <li>
            ⓶ 14세 미만 아동의 가입 신청은 거절되며, 회원가입 이후 14세 미만임이
            확인될 경우에는 제 7조에 따라 서비스 이용이 제한됩니다.
          </li>
        </ol>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제7조 (서비스의 내용)
        </h2>
        <ol className="list-decimal pl-6 mb-6 text-gray-600">
          <li>
            ⓵ 제 5조에 의한 가입신청자의 신청에 대하여, 회사는 원칙적으로
            서비스의 이용을 승낙합니다. 단, 회사는 다음 각 호에 해당하는 신청에
            대하여는 그 사유가 해소될 때까지 승낙을 유보하거나 승낙을 거부할 수
            있습니다.
          </li>
          <li>
            ⓶ 제 1항에 따라 회사가 회원가입 신청의 승낙을 유보하거나 거절한
            경우, 회사는 이용신청자에게 승낙 유보의 사유, 승낙 가능시기 또는
            승낙에 필요한 추가요청정보 내지 자료 등 기타 승낙을 위한 정보를
            제공합니다.
          </li>
        </ol>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제8조 (회원의 의무)
        </h2>
        <p className="mb-6 text-gray-600">
          회원은 본 약관, 관련 법령, 서비스에서 공지하는 이용 수칙 및 회사의
          지침을 준수하여야 하며, 이를 위반할 경우 서비스 이용에 제한을 받을 수
          있습니다.
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제9조 (서비스의 이용개시)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회사는 회원의 이용 신청을 승낙한 때부터 서비스를 개시합니다. 단,
          일부 서비스의 경우 에는 지정된 일자부터 서비스를 개시합니다.
          <br />
          ⓶ 회사의 업무상 또는 기술상의 장애로 인하여 서비스를 개시하지 못하는
          경우에는 사이트 에 공시하거나 회원에게 이를 통지합니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제10조 (서비스의 이용시간)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 서비스의 이용은 연중무휴 1일 24시간을 원칙으로 합니다. 다만, 회사의
          업무 상이나 기 술상의 이유로 서비스가 일시 중지될 수 있고, 또한 운영
          상의 목적으로 회사가 정한 기간 에는 서비스가 일시 중지될 수 있습니다.
          이러한 경우 회사는 사전 또는 사후에 이를 공지 합니다.
          <br />
          ⓶ 회사는 서비스를 일정범위로 분할하여 각 범위 별로 이용 가능한 시간을
          별도로 정할 수 있으며 이 경우 그 내용을 공지합니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제11조 (서비스의 변경 및 중단)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회사는 변경될 서비스의 내용 및 제공일자를 제21조에서 정한 방법으로
          회원에게 통지 하고 서비스를 변경하여 제공할 수 있습니다.
          <br />
          ⓶ 회사는 다음 각 호에 해당하는 경우 서비스의 전부 또는 일부를
          제한하거나 중단할 수 있습니다.
          <br />
          <ol>
            <li>서비스용 설비의 보수 등 공사로 인한 부득이한 경우</li>
            <li>회원이 본 약관의 규정을 위반하는 경우</li>
            <li>
              정전, 제반 설비의 장애 또는 이용량의 폭주 등으로 정상적인 서비스
              이용에 지장이 있는 경우
            </li>
            <li>
              서비스 제공업자와의 계약 종료, 경영상의 판단 등과 같은 회사의 제반
              사정으로 서비스 를 유지할 수 없는 경우
            </li>
            <li>기타 천재지변, 국가비상사태 등 불가항력적 사유가 있는 경우</li>
          </ol>
          ⓷ 제2항에 의한 서비스 중단의 경우에는 회사가 제20조에서 정한 방법으로
          이용자에게 통 지합니다. 다만, 회사가 통제할 수 없는 사유로 인한
          서비스의 중단 (운영자의 고의, 과실이 없는 장애, 시스템 다운 등)으로
          인하여 사전 통지가 불가능한 경우에는 그 사유가 종료된 후 즉시
          통지합니다. <br />
          ⓸ 회사는 무료로 제공되는 서비스의 변경, 중단으로 발생하는 문제에
          대해서 회사에 귀책 사유가 없는한 책임도 지지 않습니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제12조 (정보의 제공 및 광고의 게재)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회사는 서비스를 운영함에 있어 회사 또는 제휴사의 서비스 관련 각종
          광고를 서비스 화 면에 게재하거나 회원의 동의를 얻어 E-mail 및
          서신우편, SMS(MMS), TM(Telemarketing), App push 등의 방법으로 회원에게
          제공할 수 있습니다.
          <br />
          ⓶ 회원이 서비스상에 게재되어 있는 광고를 이용하거나 서비스를 통한
          광고주의 판촉활동 에 참여하는 등의 방법으로 교신 또는 거래를 하는 것은
          전적으로 회원과 광고주 간의 문제 입니다. 회원과 광고주간에 분쟁, 기타
          문제가 발생하는 경우, 회원과 광고주가 직접 해결하 여야 하며, 이와
          관련하여 회사는 귀책사유가 없는 한 책임도 지지 않습니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제13조 (게시물 또는 내용물의 삭제)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회사는 회원이 게시하거나 전달하는 서비스 내의 모든 내용물(회원간
          전달 포함)이 다음 각 호의 경우에 해당한다고 판단되는 경우 사전통지
          없이 게시, 전달 등을 중단할 수 있으 며, 이에 대해 회사는 귀책사유가
          없는 한 책임도 지지 않습니다.
          <br />
          <ol>
            <li>
              회사, 다른 회원 또는 제3자를 비방하거나 중상모략으로 명예를
              손상시키는 내용인 경우
            </li>
            <li>
              공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형 등의
              유포에 해당하는 경우
            </li>
            <li>범죄적 행위에 결부된다고 인정되는 내용인 경우</li>
            <li>
              회사 또는 제3자의 저작권 등 기타 권리를 침해하는 내용인 경우
            </li>
            <li>
              제2항 소정의 세부이용지침을 통하여 회사에서 규정한 게시기간을
              초과한 경우
            </li>
            <li>불필요하거나 승인되지 않은 광고, 판촉물을 게재하는 경우</li>
            <li>기타 관계 법령 및 회사의 지침 등에 위반된다고 판단되는 경우</li>
          </ol>
          ⓶ 회사는 게시물에 관련된 세부 이용지침을 별도로 정하여 시행할 수
          있으며, 회원은 그 지침에 따라 각종 게시물(회원간 전달 포함)을
          등록하거나 삭제하여야 합니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제14조 (게시물의 저작권)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회원이 서비스 내에 게시한 게시물(회원간 전달 포함)의 저작권은 회원이
          보유하며, 회사 는 서비스 활성화를 위하여 서비스 내에 이를 게시, 기타
          활용할 수 있는 권리를 가집니다.
          <br />
          ⓶ 회사는 게시한 회원의 동의 없이 게시물을 제1항 후단 외에 다른
          목적으로 사용할 수 없습니다.
          <br />
          ⓷ 회사는 회원이 서비스 내에 게시한 게시물이 타인의 저작권, 기타 권리를
          침해하더라도 회사의 귀책사유가 없는 한 이에 대한 민ᆞ형사상의 책임을
          부담하지 않습니다. 만일 회원 이 타인의 저작권 기타 권리를 침해하였음을
          이유로 회사가 귀책사유 없이 타인으로부터 손해배상청구 등 이의 제기를
          받은 경우, 회원은 회사의 면책을 위하여 노력하여야 하며, 회원 은 그로
          인해 회사에 발생한 모든 손해를 부담하여야 합니다.
          <br />
          ⓸ 회사는 회원이 이용계약을 해지하거나 본 약관에 의한 적법한 사유로
          이용 계약이 해지 된 경우, 해당 회원이 게시하였던 게시물을 삭제할 수
          있습니다.
          <br />
          ⓹ 회사가 작성한 저작물에 대한 저작권은 회사에 귀속됩니다.
          <br />
          ⓺ 회원은 서비스를 이용하여 얻은 정보를 가공, 판매하는 행위 등 서비스에
          게재된 타인의 자료를 영리목적으로 이용하거나 제3자에게 이용하게 할 수
          없으며, 게시물에 대한 저작권 침해는 관계 법령의 적용을 받습니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제15조 (포인트 적립 또는 오리알 제도)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회사는 회원에게 서비스 이용을 위하여 포인트 및 오리알을 부여할 수
          있으며, 회원은 유료서비스, 제휴서비스 등의 서비스 이용시 회사의 정책에
          따라 포인트를 사용할 수 있습 니다.
          <br />
          ⓶ 회사는 포인트의 적립 및 오리알의 획득 방법, 사용 방법, 환불 및
          재적립 여부, 유효기간 등과 관련된 세부이용지침을 별도로 정하여
          시행하며, 회원은 그 지침에 따라야 합니다.
          <br />
          ⓷ 회사는 각 서비스의 특성이나 포인트 운영과 관련한 세부이용지침에 따라
          결제수단을 제 한할 수 있습니다.
          <br />
          ⓸ 회사는 포인트 제휴업체와 회원의 포인트 적립 및 사용을 위하여 필요한
          최소한의 정보 (아이디, 기타 회원의 식별을 위하여 필요한 정보, 물품
          배송의 경우 배송에 필요한 성명, 주 소, 전화번호)를 제공하거나 받을 수
          있습니다.
          <br />
          ⓹ 회사가 무상으로 지급한 포인트는 대여•양도 또는 담보의 대상이 될 수
          없으며, 어떠한 경우에도 유상으로 거래하거나 현금으로 환급, 전환될 수
          없습니다.
          <br />
          ⓺ 포인트 적립 및 오리알의 획득 방법은 다음과 같습니다.
          <br />
          <ol>
            <li>영상광고를 시청하면 포인트가 지급됩니다.</li>
            <li>
              특정 플레이스 방문 후 방문체크인을 하면 오리알이 지급됩니다.
            </li>
            <li>방문한 플레이스에 후기를 남기면 오리알이 지급됩니다.</li>
            <li>오리알을 깨면 포인트가 지급됩니다.</li>
            <li>오리알 탐지기 기능을 통해 오리알을 획득할 수 있습니다.</li>
          </ol>
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제16조 (제휴 서비스의 이용)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회원은 회사의 제휴사가 제공하는 다양한 제휴서비스를 이용할 수
          있습니다. 제휴서비스 제공자는 회사가 아닌 제휴사이며, 거래당사자가
          아닌 회사는 제휴서비스와 관련하여 고의 또는 과실이 없는 한 책임을 지지
          않습니다. 제휴서비스 이용과 관련내용은 제휴사의 이용 약관을 따르며,
          회원은 이를 직접 확인하여야 합니다. 또한 회사는 회원이 이용약관을 확인
          할 수 있도록 제휴사 홈페이지 등에 연결해줄 수 있고, 회원이
          제휴서비스를 이용하기 전에 서비스 화면을 통하여 이용요금 등을
          안내합니다.
          <br />
          ⓶ 서비스 내에서 포인트로 구매하신 상품 또는 제휴서비스는 회원의
          단순변심으로 인한 환 불 및 취소가 불가능합니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제17조 (포인트 및 오리알의 정정, 취소 및 소멸)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 포인트의 유효기간은 적립된 시점으로부터 12개월입니다.
          <br />
          ⓶ 사용하지 않은 포인트는 유효기간이 종료되면 차례로 소멸됩니다.
          <br />
          ⓷ 사용하지 않은 오리알은 매달 말일 자정에 소멸됩니다.
          <br />
          ⓸ 부정한 방법으로 포인트 또는 오리알을 획득한 사실이 확인될 경우
          회사는 회원의 포인 트 및 오리알 회수, ID(고유번호) 삭제 및 형사 고발
          등 기타 조치를 취할 수 있습니다.
          <br />
          ⓹ 회사가 이용계약에 기초하여 회원에게 무상으로 지급한 포인트는
          이용계약 해지와 함께 자동으로 소멸됩니다.
          <br />
          ⓺ 포인트 적립 및 소멸에 오류가 발생한 경우 회원은 오류 발생일로부터
          30일 이내에 회 사에 정정요구를 할 수 있으며, 회사는 정당한 요구임이
          확인된 경우 정정요구일로부터 30 일 이내에 정정하여야 합니다. 단,
          회원은 회사에 오류를 명확하게 증명할 수 있는 자료를 정정요구와 함께
          제출해야 합니다.
          <br />
          ⓻ 회사와 광고주 간의 거래 과정에서 광고주의 파산, 부도 등 광고료의
          지급이 불가능해진 경우 회사는 당해 광고에 관해 적립된 마일리지를
          취소할 수 있으며, 이에 대한 책임은 광 고주에게 있습니다. 이 경우
          회사는 취소된 포인트의 10% 이하의 범위에서 회원에게 보상 포인트를
          제공할 수 있습니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제18조 (회사의 의무)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회사는 서비스 제공과 관련하여 취득한 회원의 개인정보 또는
          위치정보(이하 통칭할 경 우 “개인정보 등”)를 본인의 승낙 없이 제3자에게
          누설, 배포하지 않습니다. 단, 관계법령에 의한 수사상의 목적으로
          관계기관으로부터 요구 받은 경우 등 법률의 규정에 따른 적법한 절차에
          의한 경우에는 그러하지 않습니다.
          <br />
          ⓶ 회사는 업무와 관련하여 회원의 사전 동의 없이 회원 전체 또는 일부의
          개인정보 등을 특정 회원의 정보를 구별할 수 없는 통계자료로 작성하여
          이를 사용할 수 있고, 이를 위하 여 회원의 컴퓨터에 쿠키를 전송할 수
          있습니다. 이 경우 회원은 쿠키의 수신을 거부하거나 쿠키의 수신에 대하여
          경고하도록 사용하는 컴퓨터의 브라우저의 설정을 변경할 수 있으며, 다만,
          이 경우 쿠키의 설정 변경으로 인해 회사의 귀책사유 없이 서비스 이용이
          변경될 수 있습니다.
          <br />
          ⓷ 회사는 서비스와 관련한 회원의 불만사항이 접수되는 경우 이를 신속하게
          처리하여야 하 며, 신속한 처리가 곤란한 경우 그 사유와 처리 일정을
          서비스 화면에 게재하거나 E-mail 등을 통하여 동 회원에게 통지합니다.
          <br />
          ⓸ 회사가 제공하는 서비스로 인하여 회원에게 손해가 발생한 경우 그러한
          손해가 회사의 귀책사유에 의하여 발생한 경우에 한하여 회사에서 책임을
          부담합니다.
          <br />
          ⓹ 회사는 정보통신망 이용촉진 및 정보보호 등에 관한 법률, 위치정보의
          보호 및 이용 등 에 관한 법률, 개인정보 보호법, 통신비밀보호법,
          전기통신사업법 등 서비스의 운영, 유지와 관련 있는 법규를 준수합니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제19조 (회원의 의무)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회원은 서비스를 이용할 때 다음 각 호의 행위를 하여서는 아니 됩니다.
          <br />
          <ol>
            <li>
              이용 신청 또는 변경 시 허위 사실을 기재하거나, 다른 회원의 ID 및
              PASSWORD를 도 용, 부정하게 사용하거나, 이동전화 명의자의 허락 없이
              실사용자가 “SMS 인증”, 범용공인인 증 또는 신용카드인증 등을
              수행하는 행위
            </li>
            <li>
              특정 플레이스 방문 후 방문체크인을 하면 오리알이 지급됩니다.
            </li>
            <li>
              회사의 서비스 정보를 이용하여 얻은 정보를 회사의 사전 승낙 없이
              복제 또는 유통시키거나 상업적으로 이용하는 행위
            </li>
            <li>
              게시판 등에 음란물을 게재하거나 음란사이트를 연결(링크)하는 행위
            </li>
            <li>회사 또는 제3자의 저작권 등 기타 권리를 침해하는 행위</li>
            <li>
              공공질서 및 미풍양속에 위반되는 내용의 정보, 문장, 도형, 음성 등을
              타인에게 유포하는 행위
            </li>
            <li>
              서비스와 관련된 설비의 오 동작이나 정보 등의 파괴 및 혼란을
              유발시키는 컴퓨터 바이 러스 감염 자료를 등록 또는 유포하는 행위
            </li>
            <li>
              서비스 운영을 고의로 방해하거나 서비스의 안정적 운영을 방해할 수
              있는 정보 및 수신자의 명시적인 수신거부의사에 반하여 광고성 정보
              또는 스팸메일(Spam Mail)을 전송하는 행위
            </li>
            <li>
              타인으로 가장하는 행위 및 타인과의 관계를 허위로 명시하는 행위
            </li>
            <li>다른 회원의 개인정보를 수집, 저장, 공개하는 행위</li>
            <li>
              자기 또는 타인에게 재산상의 이익을 주거나 타인에게 손해를 가할
              목적으로 허위의 정보를 유통시키는 행위
            </li>
            <li>재물을 걸고 도박하거나 사행행위를 하는 행위</li>
            <li>
              윤락행위를 알선하거나 음행을 매개하는 내용의 정보를 유통시키는
              행위
            </li>
            <li>
              수치심이나 혐오감 또는 공포심을 일으키는 말이나 음향, 글이나 화상
              또는 영상을 계 속하여 상대방에게 도달하게 하여 상대방의 일상적
              생활을 방해하는 행위
            </li>
            <li>서비스에 게시된 정보를 변경하는 행위</li>
            <li>
              관련 법령에 의하여 그 전송 또는 게시가 금지되는 정보(컴퓨터
              프로그램 포함)의 전송 또는 게시행위
            </li>
            <li>
              회사의 직원이나 운영자를 가장하거나 사칭하여 또는 타인의 명의를
              도용하여 글을 게 시하거나 메일을 발송하는 행위
            </li>
            <li>
              컴퓨터 소프트웨어, 하드웨어, 전기통신 장비의 정상적인 가동을 방해,
              파괴할 목적으로 고안된 소프트웨어 바이러스, 기타 다른 컴퓨터 코드,
              파일, 프로그램을 포함하고 있는 자료 를 게시하거나 E-mail으로
              발송하는 행위
            </li>
            <li>스토킹(stalking) 등 다른 회원을 괴롭히는 행위</li>
            <li>
              이용의사 없이 반복적인 호출 또는 예약 및 취소 등을 통해 회사의
              서비스 제공을 방해 하는 행위
            </li>
            <li>
              고의적으로 결제 미수를 발생시키거나 미수가 장기간 발생되어
              정상적인 서비스 이용으 로 보기 어려운 행위
            </li>
            <li>기타 불법적이거나 부당한 행위</li>
          </ol>
          ⓶ 회원은 관계 법령, 본 약관의 규정, 이용안내 및 서비스상에 공지한
          주의사항, 회사가 통 지하는 사항 등을 준수하여야 합니다.
          <br />
          ⓷ 회원은 회사에서 공식적으로 인정한 경우를 제외하고는 서비스를
          이용하여 상품을 판매 하는 영업활동을 할 수 없으며 특히 해킹, 광고를
          통한 수익, 음란사이트를 통한 상업행위, 상용소프트웨어 불법 배포 등을
          할 수 없습니다. 이를 위반하여 발생한 영업 활동의 결과 및 손실,
          관계기관에 의한 구속 등 법적 조치 등은 회사와는 무관하며, 회원은 이와
          같은 행 위와 관련하여 회사에 대하여 손해배상 의무를집니다.
          <br />
          ⓸ 회원이 제1항에 명시된 행위를 한 경우에 회사는 부가적으로 제공한
          혜택의 일부 또는 전부의 회수, 특정 서비스의 이용제한, 이용계약의
          해지할 수 있으며 회사에 손해가 발생한 경우에는 손해배상의 청구 등의
          조치를 할 수 있습니다.
          <br />
          ⓹ 회사가 제4항에 정한 조치를 할 경우 회사는 사전에 회원에게 서비스
          어플리케이션∙사이 트내 게재 또는 유선전화∙E-mail, SMS, App push 등으로
          통보하며, 회원의 연락이 두절되거 나 긴급을 요하는 것과 같이 부득이한
          경우, 선 조치 후 사후 통보할 수 있습니다.
          <br />
          ⓺ 회원은 제4항에 의한 회사의 조치에 대하여 항변의 사유가 있는 경우
          이에 대하여 항변 을 할 수 있습니다.
          <br />
          ⓻ 제4항에 의하여 회사가 회원과의 이용계약을 해지하더라도, 해지 이전에
          이미 체결된 계 약의 완결에 관해서는 본 약관이 그대로 적용됩니다.
          <br />
          ⓼ 제4항에서 정한 바에 따라 이용계약이 종료될 시에는 회사는 별도 통지
          없이 해당 회원 과 관련된 거래를 취소할 수 있고, 구매회원이 상품의
          결제를 신용카드로 결제한 경우에는 그 신용카드매출을 취소할 수
          있습니다.
          <br />
          ⓽ 제4항에서 정한 바에 따라 이용계약이 종료되는 경우 회원의
          재이용신청에 대하여 회사 는 그 승낙을 거절할 수 있습니다.
          <br />
          ⓾ 회원은 서비스 이용을 위해 등록할 경우 현재의 사실과 일치하는 완전한
          정보(이하 "등 록정보")를 제공하여야 합니다.
          <br />
          ⑪ 회원은 등록정보에 변경사항이 발생할 경우 즉시 갱신하여야 원활한
          서비스를 제공받으 실 수 있습니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제20조 (개인정보 등의 변경, 보호)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회원은 이용신청 시 기재한 사항이 변경되었을 경우에는 즉시 변경사항을
          최신의 정보로 수정하여야 합니다. 단, 이름, 회원 ID 등은 회사의 승인을
          받아 수정할 수 있습니다.
          <br />
          ⓶ 수정하지 않은 정보로 인하여 발생하는 손해는 당해 회원이 부담하며,
          회사는 이에 대하여 귀책사유가 없는 한 책임을 지지 않습니다.
          <br />
          ⓷ 회사는 회원의 정보를 서비스를 제공하기 위한 목적 이외의 용도로
          사용하거나 회원의 동의 없이 제 3자에게 제공하지 않습니다. 단, 다음의
          경우는 예외로 합니다.
          <br />
          <ol>
            <li>
              서비스 제공에 관한 계약을 이행하기 위한 것으로 판매자에게 거래
              내역, 정산 내역 제공 등에 필요한 최소한의 회원정보(성명, 연락처
              등)를 제공하는 경우
            </li>
            <li>
              법령에서 회원의 개인정보의 이용과 제3자에 대한 정보제공을 허용하고
              있는 경우
            </li>
          </ol>
          ⓸ 회사는 관련법령이 정하는 바에 따라서 회원 등록정보를 포함한 회원의
          개인정보 등을 보호하기 위하여 노력합니다. 회원의 개인정보 등의 보호에
          관해서는 관련 법령 및 회사가 정하는 개인정보처리방침에 정한 바에
          의합니다.
          <br />
          ⓹ 회사는 수집된 개인정보 등의 취급 및 관리 등의 업무를 스스로 수행함을
          원칙으로 하나, 필요한 경우 회원의 동의를 받거나 통지를 한 후 위 업무의
          일부 또는 전부를 회사가 선정한 회사에 위탁할 수 있습니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제21조 (계약해지 및 이용제한)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회원은 다음 각 호에서 정한 바에 따라 이용계약을 해지할 수 있습니다.
          <br />
          <ol>
            <li>
              회원은 언제든지 회사에 이용계약 해지의 의사를 통지함으로써
              이용계약을 해지할 수 있습니다. 단, 해지의사를 통지하기 전에 현재
              진행 중인 모든 상품의 거래를 완료하거나 철회 또는 취소하여야 하며,
              회사는 귀책사유가 없는 한 해당 상품거래에 관하여 책임을 부담하지
              않습니다.
            </li>
            <li>
              회원탈퇴로 인해 발생할 수 있는 사항에 대하여 회사는 귀책사유가
              없는 한 책임을 부담 하지 아니하며, 이용계약이 종료되면 회사가
              이용계약에 기초하여 회원에게 부가적으로 제공한 혜택이 함께
              종료됩니다.
            </li>
          </ol>
          ⓶ 회사는 회원이 제20조에 규정한 회원의 의무를 이행하지 않을 경우, 사전
          통지 후 이용 계약을 해지하거나 또는 서비스 이용을 중단 조치를 취할 수
          있습니다. 다만 긴급히 조치할 필요가 있는 경우에는 사후에 통지할 수
          있습니다.
          <br />
          ⓷ 회사는 회원이 이용계약을 체결하여 ID와 PASSWORD를 부여 받은 후에라도
          회원의 자격에 제한이 있는 때에는 서비스 이용을 제한할 수 있습니다.
          <br />
          ⓸ 회사는 회원 가입 후 3개월 동안 서비스 사용 이력이 없는 회원에
          대하여는, 일정 기간을 정하여 사용의사를 묻고 고지한 바에 따라 계약을
          종료할 수 있습니다.
          <br />
          ⓹ 제2항 내지 제4항의 회사 조치에 대하여 회원은 회사가 정한 절차에 따라
          이의신청을 할 수 있습니다.
          <br />
          ⓺ 제5항의 이의가 정당하다고 회사가 인정하는 경우, 회사는 즉시 서비스의
          이용을 재개합니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제22조 (양도 금지)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회원은 서비스의 이용권한, 기타 이용 계약상 지위를 타인에게 양도,
          증여, 담보 제공할 수 없습니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제23조 (손해배상)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회원이 본 약관의 규정을 위반함으로 인하여 회사에 손해가 발생하게
          되는 경우, 본 약관을 위반한 회원은 회사에 발생하는 손해를 배상하여야
          합니다.
          <br />
          ⓶ 회원이 서비스를 이용함에 있어 행한 불법행위나 본 약관 위반행위로
          인하여 회사가 당 해 회원 이외의 제3자로부터 손해배상 청구 또는 소송을
          비롯한 각종 이의제기를 받는 경 우 당해 회원은 자신의 책임과 비용으로
          회사를 면책시켜야 하며, 당해 회원은 그로 인하여 회사에 발생한 손해를
          배상하여야 합니다.
          <br />
          ⓷ 회사의 고의나 과실에 의하여 회원에게 손해가 발생한 경우 그러한
          손해에 대하여는 회사에서 책임을 부담하여야 합니다.
          <br />
          ⓸ 어떠한 경우에도 회사가 서비스와 관련된 모든 손해에 관하여 회원에게
          부담하는 책임의 총액은 회원이 손해 발생 이전 12개월 동안 회사에게
          손해의 원인이 된 서비스 대가로 지급한 금액을 초과하지 않습니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제24조 (면책사항)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 회사는 천재지변 또는 이에 준하는 불가항력, 정보통신설비의 보수점검,
          교체 또는 고장, IDC 장애, 통신불능, 지진 등 자연재해, 정부 조치 또는
          명령, 노동쟁의 또는 기타 소요사태 등 회사가 합리적으로 통제할 수 없는
          범위의 사유로 인하여 서비스를 제공할 수 없는 경우에는 서비스의
          이용장애에 대하여 책임을 지지 않습니다.
          <br />
          ⓶ 회사는 (i) 회원이 회사가 제공하는 서비스에 접근하거나 이용할 수 없는
          상태, (ii) 서비스 이용과 관련되거나, 연관된 기대 이익 상실, 데이터
          상실, 신체 손상, 재산 손해 등 간접적, 부수적, 특수적, 징벌적 또는
          결과적 손해(일실이익, 고객, 기회 및 영업권의 손실 포함) 에 관하여
          회사가 고의, 과실이 없는 한 회원에게 책임을 부담하지 않으며, 이러한
          피해의 가능성에 대해 통지를 받았더라도 마찬가지입니다.
          <br />
          ⓷ 회사는 회원의 귀책사유로 인한 서비스의 이용장애에 대하여 책임을 지지
          않습니다.
          <br />
          ⓸ 회사가 서비스를 통해 제공하는 2차 가공, 통계 등 자료는 회사의 추정
          의견으로 정확성을 담보하지 않으며, 이로 인한 고객의 손해를 책임지지
          않습니다.
          <br />
          ⓹ 회원이 자신의 개인정보를 타인에게 유출 또는 제공함으로써 발생하는
          피해에 대해서 회사는 귀책사유가 없는 한 책임을 지지 않습니다.
          <br />
          ⓺ 상품 또는 정보 등을 통해 표현하거나 드러나는 회원의 견해는 회사의
          견해가 아니며, 회사는 회원, 제휴사가 게재한 상품 또는 정보 등의
          정확성을 보증하지 않으며 이로 인한 손해를 책임지지 않습니다.
          <br />
          ⓻ 서비스 화면에서 링크, 배너 등을 통하여 연결된 회사(이하
          피연결회사)와 회원간에 이루어진 거래에 회사는 무관합니다.
          <br />
          ⓼ 회사가 제공하는 중개 서비스에 관하여, 회사는 서비스를 이용하는
          회원과 서비스 제공자 간의 거래를 중개하는 시스템을 운영•관리•제공할
          뿐, 회원을 포함한 거래당사자(제휴사, 운송제공자 등 포함)들을
          대리하지는 않습니다. 거래당사자 간 성립된 거래와 관련한 정보, 서비스,
          운임 및 이용료 등에 대한 책임은 각 거래당사자가 직접 부담합니다.
          <br />
          ⓽ 회사가 제공하는 중개 서비스에 관하여, 회사는 회원과 서비스 제공자
          간의 거래와 관련 하여 서비스 신청의사 또는 수락의사의 존부 및 진정성,
          거래 대상의 품질, 완전성, 안전성, 적법성 및 타인의 권리에 대한
          비침해성, 회원 또는 서비스 제공자가 제공한 정보 및 그 정보의 진실성
          또는 적법성 등 일체에 대하여 보증하지 않고, 그와 관련하여 어떠한
          책임도 부담하지 않습니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">
          제25조 (분쟁의 해결 및 관할법원)
        </h2>
        <p className="mb-6 text-gray-600">
          ⓵ 서비스 이용과 관련하여 회사와 회원 사이에 분쟁이 발생한 경우, 회사와
          회원은 분쟁의 해결을 위해 성실히 협의합니다.
          <br />
          ⓶ 제1항의 협의에서도 분쟁이 해결되지 않을 경우 양 당사자는
          전기통신사업법 제 45조(방송통신위원회의 재정), 개인정보보호법
          제43조(조정의 신청 등)의 규정에 의하여 방송통신위 원회 또는
          개인정보분쟁조정위원회에 분쟁조정을 신청할 수 있습니다.
          <br />
          ⓷ 제2항에 의하여서도 분쟁이 해결되지 않을 경우 양 당사자는
          민사소송법상의 관할법원 에 소를 제기할 수 있습니다.
          <br />
        </p>

        <h2 className="text-2xl font-semibold text-gray-700 mt-8 mb-4">부칙</h2>
        <p className="mb-6 text-gray-600">
          <ol>
            <li>이 약관은 2025년 1월 1일부터 시행됩니다.</li>
          </ol>
        </p>
      </div>
    </>
  );
};

export default Terms;
